tutorials/rasInterFoam/damBreak/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4.1                                 |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version 2.0;
    format ascii;

    root "/home/dm2/henry/OpenFOAM/OpenFOAM-1.4.1/tutorials/rasInterFoam";
    case "damBreak";
    instance "constant";
    local "polyMesh";

    class polyBoundaryMesh;
    object boundary;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
leftWall
{
    type wall;
    physicalType wallFunctions;
    nFaces 50;
    startFace 4432;
}

rightWall
{
    type wall;
    physicalType wallFunctions;
    nFaces 50;
    startFace 4482;
}

lowerWall
{
    type wall;
    physicalType wallFunctions;
    nFaces 62;
    startFace 4532;
}

atmosphere
{
    type patch;
    physicalType atmosphere;
    nFaces 46;
    startFace 4594;
}

defaultFaces
{
    type empty;
    nFaces 4536;
    startFace 4640;
}
)

// ************************************************************************* //
