tutorials/rasInterFoam/damBreak/system/fvSolution
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          fvSolution;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    pcorr PCG
    {
        preconditioner   DIC;
        tolerance        1e-10;
        relTol           0;
    };
    pd PCG
    {
        preconditioner   DIC;
        tolerance        1e-7;
        relTol           0.05;
    };
    pdFinal PCG
    {
        preconditioner   DIC;
        tolerance        1e-7;
        relTol           0;
    };
    U PBiCG
    {
        preconditioner   DILU;
        tolerance        1e-06;
        relTol           0;
    };
    k PBiCG
    {
        preconditioner   DILU;
        tolerance        1e-08;
        relTol           0;
    };
    epsilon PBiCG
    {
        preconditioner   DILU;
        tolerance        1e-08;
        relTol           0;
    };
    R PBiCG
    {
        preconditioner   DILU;
        tolerance        1e-08;
        relTol           0;
    };
    nuTilda PBiCG
    {
        preconditioner   DILU;
        tolerance        1e-08;
        relTol           0;
    };
}

PISO
{
    momentumPredictor no;
    nCorrectors     3;
    nNonOrthogonalCorrectors 0;
    nGammaCorr      1;
    nGammaSubCycles 4;
    cGamma          2;
}


// ************************************************************************* //
